// Common Strings
"Okay" = "Ok";
"Cancel" = "Annulla";

// Servers
"RFBDefaultServerName" = "Nuovo Server";
"RFBUntitledServerName" = "Server Senza Titolo";
"Connecting..." = "Connetto...";
"Connect" = "Connetti";
"DisplayIsPort" = "Video %d è porta %d";
"PortIsDisplay" = "Porta %d è video %d";
"PortNum" = "Porta %d";

// Error Actions
"OpenConnection" = "Apri Connessione";
"NoNamedServer" = "Non posso trovare un server di nome \"%@\"";
"NoConnection" = "Non posso collegarmi al server %@ porta %d";
"NoReconnection" = "Could not reconnect to server %@";
"NotVNC" = "Not a VNC server";
"UnknownAuthType" = "authType %@ Sconosciuto";
"UnknownAuthResult" = "authResult %@ Sconosciuto";
"AuthenticationFailed" = "Autenticazione Fallita";
"AuthenticationFailedTooMany" = "Autenticazione Fallita (troppi tentativi)";
"AuthenticationRequired" = "Authentiation Required";
"UnknownMessageType" = "Messaggio tipo %@ sconosciuto";
"UnknownMessageTypeLastEncoding" = "Messagio tipo %@ sconosciuto. (Previous encoding was %@)";
"ServerReports" = "Resoconti Server";
//"ARDAuthWarning" = "\nPer cortesia configura Apple Desktop Remoto per permettere ai visualizzatori VNC di controllare lo schermo.\n";
"ARDAuthWarning" = "The remote server only allows Apple Remote Desktop clients to connect. Please change the settings on the server to allow VNC viewers to control the screen.";

// Profiles
"defaultProfileName" = "Profilo Iniziale";
"EditProfiles" = "Edit Connection Profiles...";

// Couldn't connect
"ConnectRefused" = "The server refused the connection";
"ConnectTimedOut" = "The connection attempt timed out";

// SSH-related errors
"SshError" = "Could not establish an SSH connection to server %@";
"SshKeyMismatch" = "Remote SSH identification has changed. Someone maybe trying to eavesdrop on the conversation";
"SshCatError" = "Error with cat";
"SshScriptError" = "Permission error with ssh script";
"SshQuit" = "The ssh program quit unexpectedly";
"SshPermissionDenied" = "Permission denied by SSH server";
"SshConnectionClosed" = "Il server SSH ha terminato la conessione";

// errors with SSH tunnel after having established SSH connection
"TunnelNoConnection" = "Couldn't establish tunneled connection to server %@ port %d";
"TunnelSocketErr" = "Error with socket(): %s";
"TunnelConnectErr" = "Error with connect(): %s";
"TunnelAdminProhibited" = "The SSH server has prohibited this type of tunnel";
"TunnelOther" = "The SSH server could not connect to the VNC server";

// SSH prompts
"FirstTimeHeader" = "First time connecting";
"FirstTimeMessage" = "The authenticity of the server could not be established.  The server key fingerprint is %@. Are you sure you want to continue connecting?";

// Connection Terminated
"ConnectionTerminated" = "Connessione Terminata";
"Reconnect" = "Riconnetti";
"ServerClosed" = "Il server ha terminato la connessione";
"ServerError" = "Scrivi al Server: %s";
"ProtocolError" = "Protocol error";
"ZrleTooSmall" = "ZRLE encoding: rectangle contained insufficient data";
"ZrleUnknownSubencoding" = "ZRLE encoding: unknown subencoding %d encountered";
"ZlibHexInflateError" = "ZlibHex encoding: inflate error: %s";
"ZlibHexDeflateTooSmall" = "ZlibHex encoding: deflate size smaller than expected";
"ZlibNeedsDict" = "Zlib encoding: inflate needs a dictionary";
"ZlibInflateError" = "Zlib encoding: inflate error: %s";
"TightBadSubencoding" = "Tight encoding: unknown subencoding received";
"TightUnknownFilter" = "Tight encoding: unknown filter code %@ received.";
"TightZeroPalette" = "Tight encoding: palette with length 0 received";
"TightWrongJpeg" = "Tight encoding: Wrong JPEG data received.";
"UnknownRectangle" = "Unknown rectangle encoding %d";
"UnknownRectangleLastEncoding" = "Unknown rectangle encoding %d. (Previous encoding was %@)";
"TightInflateInitErrorWith" = "InflateInit error: %s.\n";
"TightInflateInitError" = "InflateInit error\n";
"TightInflateErr" = "Inflate error\n";
"ZlibInflateInitErr" = "Zlib encoding: inflateInit: %s.\n";
"ZlibHexInflateErr" = "ZlibHex inflate error: %s";
"InflateInit" = "Inflate initialization error: %d, %s";
"InflateError" = "Inflate error: %d, %s";
"InflateMem" = "Inflate: couldn't allocate memory";

// Fullscreen
"FullscreenHeader" = "La tua connessione sta entrando a tutto schermo";
"Fullscreen" = "Tutto Schermo";
"FullscreenReason1" = "Puoi tornare alla modalità finestra premendo il tasto relativo ";
"FullscreenReason2" = "quando vuoi. Puoi cambiare la destinazione del tasto relativo nelle Preferenze se necessario.";
"FullscreenNoKeyHeader" = "Warning: No key for exiting fullscreen";
"FullscreenNoKey" = "There is no key equivalent set for returning to windowed mode. You can set this in preferences. Are you sure that you want to enter fullscreen mode without a key equivalent to exit?";

// Listener
"listenStart" = "Inizia";
"listenStop" = "Termina";
"listenRunning" = "L'Ascolto è acceso";
"listenStopped" = "L'Ascolto è spento";
"listenAcceptMessage" = "Connessione da %@:%d";

// Rendezvous
"AddressResolveFailed" = "Risoluzione indirizzo fallita";
"Resolving" = "Risolvo..";

// Connection Info
"ConnectionStatistics" = "Bytes Received: %@\nBytes Represented: %@\nCompression: %.2f\nRectangles: %u\nEncodings:%@";
"ServerInfo" = "VNC Protocol Version: %d.%d\nVNC Screensize: %dx%d\nProtocol Parameters\n\tBits Per Pixel: %d\n\tDepth: %d\n\tByteorder: %@\n\tTruecolor: %@\n\tMaxValues (r/g/b): %d/%d/%d\n\tShift (r/g/b): %d/%d/%d";
"big-endian" = "big-endian";
"little-endian" = "little-endian";
"yes" = "si";
"no" = "no";

// Paste to Remote Server
"PasteConversionHeader" = "Clipboard incompatible with Latin-1";
"PasteConversionBody" = "The VNC protocol only supports sending clipbord text in the Latin-1 encoding. Do you want to send anyways, possibly losing characters?";
"PasteAnyways" = "Paste Anyways";
